architecture/generated/dependencies.dot
digraph G {
	graph [bb="0,0,735,472",
		bgcolor="#111111",
		layout=dot,
		overlap=false,
		pad=0.3,
		rankdir=LR
	];
	node [color="#c6c5fe",
		fontcolor="#c6c5fe",
		fontname=Arial,
		fontsize="14px",
		height=0,
		label="\N",
		shape=box,
		style=rounded
	];
	edge [color="#757575"];
	"components/AnimatedGrid.tsx"	[height=0.31944,
		pos="113.5,11.5",
		width=2.7778];
	"utils/GridAnimation.ts"	[color="#cfffac",
		fontcolor="#cfffac",
		height=0.31944,
		pos="355.5,11.5",
		width=2.0278];
	"components/AnimatedGrid.tsx" -> "utils/GridAnimation.ts"	[pos="e,282.48,11.5 213.5,11.5 233.09,11.5 253.46,11.5 272.41,11.5"];
	"components/CodeBlock.tsx"	[height=0.31944,
		pos="113.5,52.5",
		width=2.5139];
	"data/codeSnippets.ts"	[color="#cfffac",
		fontcolor="#cfffac",
		height=0.31944,
		pos="355.5,52.5",
		width=1.9861];
	"components/CodeBlock.tsx" -> "data/codeSnippets.ts"	[pos="e,284,52.5 204.21,52.5 227.07,52.5 251.5,52.5 273.88,52.5"];
	"components/PlantUMLDiagram.tsx"	[color="#cfffac",
		fontcolor="#cfffac",
		height=0.31944,
		pos="113.5,93.5",
		width=3.1528];
	"components/TechStack.tsx"	[height=0.31944,
		pos="113.5,134.5",
		width=2.4722];
	"data/technologies.ts"	[color="#cfffac",
		fontcolor="#cfffac",
		height=0.31944,
		pos="355.5,134.5",
		width=1.9028];
	"components/TechStack.tsx" -> "data/technologies.ts"	[pos="e,286.81,134.5 202.5,134.5 226.74,134.5 252.86,134.5 276.49,134.5"];
	"components/ThemeToggle.tsx"	[height=0.31944,
		pos="113.5,214.5",
		width=2.75];
	"services/FaviconManager.ts"	[height=0.31944,
		pos="355.5,255.5",
		width=2.5694];
	"components/ThemeToggle.tsx" -> "services/FaviconManager.ts"	[pos="e,287.1,243.99 181.99,226.03 211.51,231.07 246.32,237.02 276.9,242.24"];
	"services/ThemeManager.ts"	[height=0.31944,
		pos="355.5,214.5",
		width=2.5];
	"components/ThemeToggle.tsx" -> "services/ThemeManager.ts"	[pos="e,265.21,214.5 212.81,214.5 226.77,214.5 241.13,214.5 255.11,214.5"];
	"services/ThemeStorage.ts"	[color="#cfffac",
		fontcolor="#cfffac",
		height=0.31944,
		pos="609.5,194.5",
		width=2.4167];
	"components/ThemeToggle.tsx" -> "services/ThemeStorage.ts"	[pos="e,522.48,190.77 181.56,202.98 206.98,199.15 236.25,195.38 263,193.5 347.12,187.58 443.04,188.47 512.44,190.46"];
	"services/interfaces/IFaviconManager.ts"	[color="#cfffac",
		fontcolor="#cfffac",
		height=0.31944,
		pos="609.5,245.5",
		width=3.4861];
	"services/FaviconManager.ts" -> "services/interfaces/IFaviconManager.ts"	[pos="e,483.63,250.46 448.19,251.86 456.48,251.53 464.99,251.19 473.56,250.85"];
	"services/ThemeManager.ts" -> "services/ThemeStorage.ts"	[pos="e,522.38,201.33 445.7,207.42 467.21,205.71 490.29,203.88 512.12,202.15"];
	"services/ThemeManager.ts" -> "services/interfaces/IFaviconManager.ts"	[pos="e,514.72,233.96 445.7,225.47 464.75,227.82 485.03,230.31 504.58,232.72"];
	"content/config.ts"	[color="#cfffac",
		fontcolor="#cfffac",
		height=0.31944,
		pos="113.5,255.5",
		width=1.5972];
	"tests/content-schema.test.ts"	[color="#cfffac",
		fontcolor="#cfffac",
		height=0.31944,
		pos="113.5,296.5",
		width=2.5694];
	"tests/projects.test.ts"	[color="#cfffac",
		fontcolor="#cfffac",
		height=0.31944,
		pos="113.5,337.5",
		width=1.8889];
	"tests/setup.ts"	[color="#cfffac",
		fontcolor="#cfffac",
		height=0.31944,
		pos="113.5,378.5",
		width=1.3333];
	"utils/mermaid.ts"	[color="#cfffac",
		fontcolor="#cfffac",
		height=0.31944,
		pos="113.5,419.5",
		width=1.5694];
	"utils/themeInit.ts"	[color="#cfffac",
		fontcolor="#cfffac",
		height=0.31944,
		pos="113.5,460.5",
		width=1.5972];
}
